ConfigurationFonecmidDiplomTuzeka/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Договоры</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ConfigurationFonecmidDiplomTuzeka/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

ConfigurationFonecmidDiplomTuzeka/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ПродажиУслуг</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтавкаЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConfigurationFonecmidDiplomTuzeka/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создаёт документы РеализацияТоваровУслуг за период по договорам абонентского обслуживания,
// по которым реализация ещё не создана, и помещает таблицу результатов во временное хранилище.
//
// Параметры:
//  Параметры - Структура:
//   * Период - Дата - период, за который создаются акты.
//  АдресРезультата - Строка - адрес временного хранилища для таблицы результатов.
Процедура ВКМ_СоздатьАкты(Параметры, АдресРезультата) Экспорт

	Период = Параметры.Период;
	НачалоПериода = НачалоМесяца(Период);
	КонецПериода = КонецМесяца(Период);

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВКМ_Договор");
	Результат.Колонки.Добавить("ВКМ_Реализация");
	Результат.Колонки.Добавить("ВКМ_Статус");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &НачалоПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатДоговоров = Запрос.Выполнить();
	МассивДоговоров = РезультатДоговоров.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВыборкаДоговоры = РезультатДоговоров.Выбрать();

	РеализацииПоДоговорам = ВКМ_СформироватьРеализацииПоДоговорам(МассивДоговоров, НачалоПериода, КонецПериода);

	Пока ВыборкаДоговоры.Следующий() Цикл

		Договор = ВыборкаДоговоры.Ссылка;

		СтрокаРезультата = Результат.Добавить();
		СтрокаРезультата.ВКМ_Договор = Договор;

		СуществующаяРеализация = РеализацииПоДоговорам.Получить(Договор);

		Если ЗначениеЗаполнено(СуществующаяРеализация) Тогда
			СтрокаРезультата.ВКМ_Реализация = СуществующаяРеализация;
			СтрокаРезультата.ВКМ_Статус = "Уже создана";
			Продолжить;
		КонецЕсли;

		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = КонецПериода;
		НовыйДокумент.Организация = Договор.Организация;
		НовыйДокумент.Контрагент = Договор.Владелец;
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();

		Попытка
			НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
		Исключение
			СтрокаРезультата.ВКМ_Статус =
				"Ошибка автозаполнения: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Продолжить;
		КонецПопытки;

		НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма") + НовыйДокумент.Услуги.Итог("Сумма");

		Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда
			СтрокаРезультата.ВКМ_Статус = "Не заполнены обязательные поля документа";
			Продолжить;
		КонецЕсли;

		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			СтрокаРезультата.ВКМ_Реализация = НовыйДокумент.Ссылка;
			СтрокаРезультата.ВКМ_Статус = "Создана";
		Исключение
			СтрокаРезультата.ВКМ_Статус =
				"Ошибка проведения: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

	КонецЦикла;

	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_СформироватьРеализацииПоДоговорам(МассивДоговоров, НачалоПериода, КонецПериода)

	РеализацииПоДоговорам = Новый Соответствие;

	Если МассивДоговоров.Количество() = 0 Тогда
		Возврат РеализацииПоДоговорам;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор В (&МассивДоговоров)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если РеализацииПоДоговорам.Получить(Выборка.Договор) = Неопределено Тогда
			РеализацииПоДоговорам.Вставить(Выборка.Договор, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Возврат РеализацииПоДоговорам;

КонецФункции

#КонецОбласти

#КонецЕсли
